{"format": "layers-model", "generatedBy": "keras v3.14.0", "convertedBy": "motionwords-exporter", "modelTopology": {"keras_version": "3.14.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_2", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 42], "dtype": "float32", "sparse": false, "name": "dense_input"}, "name": "dense_input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "dense", "inbound_nodes": [["dense_input", 0, 0, {}]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [["dense", 0, 0, {}]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "dense_1", "inbound_nodes": [["dropout", 0, 0, {}]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [["dense_1", 0, 0, {}]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 26, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "dense_2", "inbound_nodes": [["dropout_1", 0, 0, {}]]}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [42, 128], "dtype": "float32"}, {"name": "dense/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [64, 26], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [26], "dtype": "float32"}]}]}